#
# .zsh_plugins.txt - antidote plugins file
#

#
# Init
#

ayu-exorcist/zsh_custom path:lib
# ayu-exorcist/zsh_custom path:plugins/p10k-instaprompt
ayu-exorcist/zsh_custom path:plugins/xdg
ayu-exorcist/zsh_custom path:plugins/history
ayu-exorcist/zsh_custom path:plugins/environment
ayu-exorcist/zsh_custom path:plugins/homebrew conditional:is-macos

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
#$ZSH_CUSTOM_DEV path:plugins/completion

#
# Editor
#

ayu-exorcist/zsh_custom path:plugins/editor
# jeffreytse/zsh-vi-mode
# sorin-ionescu/prezto path:modules/editor
# romkatv/zsh-no-ps2

#
# Prompts
#

romkatv/powerlevel10k
# mattmc3/zephyr path:plugins/prompt
# sindresorhus/pure kind:fpath
# miekg/lean kind:fpath

#
# Clipboard
#

# ohmyzsh/ohmyzsh path:lib/clipboard.zsh
# ohmyzsh/ohmyzsh path:plugins/copypath
# ohmyzsh/ohmyzsh path:plugins/copybuffer
# ohmyzsh/ohmyzsh path:plugins/copyfile

#
# Custom
#

ayu-exorcist/zsh_custom path:plugins/azure
# ayu-exorcist/zsh_custom path:plugins/clipboard
ayu-exorcist/zsh_custom path:plugins/color
ayu-exorcist/zsh_custom path:plugins/common-aliases
ayu-exorcist/zsh_custom path:plugins/common-functions
ayu-exorcist/zsh_custom path:plugins/directory
ayu-exorcist/zsh_custom path:plugins/dotfiles
ayu-exorcist/zsh_custom path:plugins/dotnet
# ayu-exorcist/zsh_custom path:plugins/fzf
ayu-exorcist/zsh_custom path:plugins/git
ayu-exorcist/zsh_custom path:plugins/git-cmds
# ayu-exorcist/zsh_custom path:plugins/golang
ayu-exorcist/zsh_custom path:plugins/gpg
ayu-exorcist/zsh_custom path:plugins/iwd
ayu-exorcist/zsh_custom path:plugins/jupyter
ayu-exorcist/zsh_custom path:plugins/otp
ayu-exorcist/zsh_custom path:plugins/prj
ayu-exorcist/zsh_custom path:plugins/python
ayu-exorcist/zsh_custom path:plugins/secrets
# ayu-exorcist/zsh_custom path:plugins/todotxt
# ayu-exorcist/zsh_custom path:plugins/up
ayu-exorcist/zsh_custom path:plugins/utility
# ayu-exorcist/zsh_custom path:plugins/terminal
# ayu-exorcist/zsh_custom path:plugins/wezterm
ayu-exorcist/zsh_custom path:plugins/zfunctions
ayu-exorcist/zsh_custom path:plugins/zoxide

#
# OMZ
#

# ohmyzsh/ohmyzsh path:plugins/magic-enter   # included in editor
# ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z  # included in editor
# ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/extract

#
# Utils
#

romkatv/zsh-bench kind:path
# aloxaf/fzf-tab
# mattmc3/zman

#
# macOS
#

ayu-exorcist/zsh_custom path:plugins/macos conditional:is-macos
# ohmyzsh/ohmyzsh path:plugins/iterm2 conditional:is-macos

#
# Final
#

ayu-exorcist/zsh_custom path:plugins/fast-syntax-highlighting
ayu-exorcist/zsh_custom path:plugins/autosuggestions
ayu-exorcist/zsh_custom path:plugins/history-substring-search
# zsh-users/zsh-history-substring-search
ayu-exorcist/zsh_custom path:plugins/zshrcd

# vi: ft=properties
